function Calculate(){
    var height = document.getElementById("h-input").value;
    var weight = document.getElementById("w-input").value;
    var bloodtype = document.getElementById("list").value;
    // var val = bloodtype.value;
    // var bt = bloodtype.options[bloodtype.selectedIndex].text;
    

    var result = parseFloat(weight) /(parseFloat(height)/100)**2;
    var result_water = parseFloat((weight)*2.2*30)/2;
    // let result_food = parseF((weight)*2.2*30)/2;

    if(!isNaN(result)){
        document.getElementById("bmi-output").innerHTML = result;
        if(result < 18.5){
            document.getElementById("bmi-status").innerHTML = "อยู่ในเกณฑ์น้ำหนักน้อยหรือผอม";
        }
        else if(result < 25){
            document.getElementById("bmi-status").innerHTML = "อยู่ในเกณฑ์ปกติ";
        }
        else if(result < 30){
            document.getElementById("bmi-status").innerHTML = "น้ำหนักเกิน";
        }
        else{
            document.getElementById("bmi-status").innerHTML = "โรคอ้วน";
        }

        document.getElementById("water-output").innerHTML = result_water;
        // document.getElementById("food-output").innerHTML = bloodtype;
    }

   
    document.getElementById("food-output").innerHTML = bloodtype;
     if(!isNaN(bloodtype)){
        
        if( bloodtype == 1 ){
            document.getElementById("food-output").innerHTML = "เลือดกรุ๊ป A คนที่มีเลือดกลุ่มนี้จะย่อยอาหารประเภทเนื้อสัตว์ไม่ค่อยดีนัก แนะนำให้รับประทานเนื้อปลา ไม่ว่าจะเป็นปลาทู ปลาแซลมอน ปลากระพง หรือหากอยากเสริมโปรตีนแนะนำให้รับประทานประเภทนมถั่วเหลืองแทนนมวัว หรือทานถั่วเพิ่มขึ้น เช่น ถั่วลิสง เมล็ดฟักทอง และเต้าหู้ นอกจากนี้ยังเน้นหนักให้รับประทานผักที่มีกากใยมากขึ้น เพื่อช่วยปัญหาเรื่องระบบย่อย และยังเป็นการสร้างภูมิต้านทานให้แก่ร่างกาย โดยสามารถทานได้แทบจะทุกชนิด เช่น บร็อคโคลี่ แครอท ฟักทอง ผักโขม พร้อมกับรับประทานผลไม้ แต่ผลไม้ที่อยากให้หลีกเลี่ยง คือ ส้ม และมะละกอ เพราะทำให้ระคายเคืองกระเพาะอาหาร ส่วนเครื่องดื่มสำหรับคนเลือดกรุ๊ปเอ ที่ติดกาแฟ ทฤษฎีนี้ระบุว่าเพียงวันละหนึ่งแก้วก็เพียงพอ เพื่อช่วยเพิ่มกรดในกระเพาะอาหาร แต่ไม่ควรดื่มนมวัว เบียร์ และโซดา";

        } else if(bloodtype == 2 ){
            document.getElementById("food-output").innerHTML = "เลือดกรุ๊ป B เป็นหมู่เลือดที่อยู่ง่าย กินง่าย รับประทานอะไรก็ได้ สามารถรับประทานเนื้อสัตว์ได้หลากหลาย อาทิ ไก่ ปลา ปลาแซลมอน ปลาเนื้อขาว กุ้ง ปู ส่วนนม เนย และไข่ กินได้ในปริมาณที่เหมาะสม แนะนำให้รับประทานข้าวกล้อง ข้าวโอ๊ต และหลีกเลี่ยงแป้งสาลี แป้งโฮลวีท และถั่วลิสง เพราะไม่ดีต่อระบบเผาผลาญ ทำให้อ้วนง่าย ส่วนผักแนะนำในกลุ่มผักใบเขียวเพราะมีแมกนีเซียมสูง ช่วยป้องกันอาการผื่นคันและภูมิแพ้ได้ ว่ากันว่าหมู่เลือด B จะแพ้อากาศได้ง่าย ส่วนผลไม้กินได้แทบทุกชนิด แต่ก็ควรเลี่ยงผลไม้รสหวาน หรือรับประทานให้น้อยลง แนะนำให้ทานสับปะรดเพราะมีเอนไซม์ช่วยให้ย่อยอาหารได้ง่ายขึ้น และทานกล้วยซึ่งอุดมไปด้วยสารอาหารมากมาย ด้านเครื่องดื่มด้วยเหตุที่บอกว่าหมู่เลือดนี้แพ้อากาศง่าย จึงแนะนำให้ดื่มน้ำขิง ชาเชียว โสม และเปปเปอร์มิ้นท์ นอกจากช่วยแก้หวัด ช่วยให้ร่างกายอบอุ่นแล้วยังช่วยบำรุงประสาทอีกด้วย";
        } else if(bloodtype == 3 ){
            document.getElementById("food-output").innerHTML = "เลือดกรุ๊ป O หมู่เลือดนี้ กระเพาะอาหารมีความเป็นกรดสูง ระบบการเผาผลาญไม่ค่อยดี จึงหิวง่าย และอ้วนง่าย ดังนั้นจึงแนะนำให้รับประทานเนื้อสัตว์ที่มีไขมันไม่สูง เช่น เนื้อปลา กุ้ง ปู มากกว่าเนื้อหมู ส่วนผักที่เป็นประโยชน์ต่อหมู่เลือดนี้ คือ ผักบร็อคโคลี่ ผักกาดคอส ผักคะน้า หอมหัวใหญ่ และสาหร่ายทะเล ไม่แนะนำผักใบขาวอย่างกะหล่ำปลี เพราะจะไปก่อกวนการทำงานของไทรอยด์ ส่วนผลไม้สามารถรับประทานผลไม้ได้ทุกชนิดโดยเฉพาะตระกูลเบอร์รี่ ที่จะช่วยสร้างสมดุลให้ระดับกรดในกระเพาะอาหารได้ ด้านเครื่องดื่ม ที่กล่าวมาข้างต้นว่าหมู่เลือดนี้กระเพาะอาหารมีความเป็นกรดสูง จึงควรเลี่ยงเครื่องดื่มประเภทชา กาแฟ เบียร์ เพราะจะไปเพิ่มปริมาณกรดในกระเพาะ";
        } else if(bloodtype == 4 ){
            document.getElementById("food-output").innerHTML = "เลือดกรุ๊ป AB กรุ๊ปนี้เป็นการผสมผสานระหว่างกรุ๊ปเลือด A กับ B วิธีรับประทานอาหารที่เหมาะสมระบุไว้ว่าสามารถรับประทานแบบลูกผสม เช่น วันนี้จะเน้นเนื้อ วันนี้จะเน้นผักสลับกันไปมาได้ แต่ถ้าให้แนะนำอยากให้รับประทานเนื้อสัตว์แต่พอประมาณ ถ้าเป็นเนื้อปลาก็ยิ่งดีต่อร่างกาย อาจเลือกรับประทานอาหารประเภทถั่วเพิ่มก็ได้ อาทิ ผลิตภัณฑ์จากถั่วเหลือง และเต้าหู้ก็มีประโยชน์ช่วยให้โปรตีนต่อร่างกายเช่นกัน ส่วนผัก แนะนำให้รับประทานผักสดโดยเลือกเมนูเป็นน้ำพริกผัก หรือสลัดก็ได้ ด้านผลไม้ ควรทานผลไม้ที่วิตามินซีสูง เช่น ส้มโอ ตระกูลเบอร์รี่ สับปะรด เพราะช่วยสร้างความสมดุลของกรดในเนื้อเยื่อ สำหรับเครื่องดื่มชา กาแฟ ดื่มได้พอประมาณ แนะนำให้ดื่มชาคาโมมายล์ และชาเขียว เพื่อช่วยฟื้นฟูระบบภูมิคุ้มกันลองพิจารณาดูว่าแบบไหนเหมาะกับเรา แต่ถ้าให้แนะนำจริงๆ ควรรับประทานอาหารให้ครบ 5 หมู่ อย่าละเลยอาหารที่มีกากใย เพื่อช่วยเรื่องของระบบการขับถ่าย บวกกับขยันออกกำลังกายอย่างสม่ำเสมอ และตรวจเช็คสุขภาพประจำปี แค่นี้เราก็มีสุขภาพที่ดีได้";
        }
      }
}

getSelectValue();


